[ThrowingKnife_CV_Secondary X2WeaponTemplate]
FriendlyName="Secondary Throwing Knife"
FriendlyNamePlural="Throwing Knives"
BriefSummary="A throwing knife made of our most advanced conventional steel alloys."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Secondary Throwing Knife"

[ThrowingKnife_MG_Secondary X2WeaponTemplate]
FriendlyName="Secondary Alloy Throwing Knife"
FriendlyNamePlural="Secondary Alloy Throwing Knives"
BriefSummary="A throwing knife made of alien alloys."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Secondary Alloy Throwing Knife"

[ThrowingKnife_BM_Secondary X2WeaponTemplate]
FriendlyName="Secondary Plasma Throwing Knife"
FriendlyNamePlural="Secondary Plasma Throwing Knives"
BriefSummary="A throwing knife with a plasma edge cutting through armor like butter."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Secondary Plasma Throwing Knife"

[ThrowingKnife_CV X2WeaponTemplate]
FriendlyName="Throwing Knife"
FriendlyNamePlural="Throwing Knives"
BriefSummary="A throwing knife made of our most advanced conventional steel alloys."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Throwing Knife"

[ThrowingKnife_MG X2WeaponTemplate]
FriendlyName="Alloy Throwing Knife"
FriendlyNamePlural="Alloy Throwing Knives"
BriefSummary="A throwing knife made of alien alloys."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Alloy Throwing Knife"

[ThrowingKnife_BM X2WeaponTemplate]
FriendlyName="Plasma Throwing Knife"
FriendlyNamePlural="Plasma Throwing Knives"
BriefSummary="A throwing knife with a plasma edge cutting through armor like butter."
TacticalText="<Bullet/>Throwing a knife has a chance to stay concealed."
AbilityDescName="Plasma Throwing Knife"

[Shuriken_CV X2WeaponTemplate]
FriendlyName="Shuriken"
FriendlyNamePlural="Shuriken"
BriefSummary="A Shuriken made of our most advanced conventional steel alloys."
TacticalText="<Bullet/Throwing a shuriken has a chance to stay concealed."
AbilityDescName="Shuriken"

[Shuriken_MG X2WeaponTemplate]
FriendlyName="Alloy Shuriken"
FriendlyNamePlural="Alloy Shuriken"
BriefSummary="A Shuriken made of alien alloys."
TacticalText="<Bullet/Throwing a shuriken has a chance to stay concealed."
AbilityDescName="Alloy Shuriken"

[Shuriken_BM X2WeaponTemplate]
FriendlyName="Plasma Shuriken"
FriendlyNamePlural="Plasma Shuriken"
BriefSummary="A Shuriken with a plasma edge cutting through armor like butter."
TacticalText="<Bullet/Throwing a shuriken has a chance to stay concealed."
AbilityDescName="Plasma Shuriken"

[SpecOpsKnife_CV X2WeaponTemplate]
FriendlyName="SpecOps Combat Knife"
FriendlyNamePlural="SpecOps Combat Knives"
BriefSummary="A serrated combat knife made of our most advanced conventional steel alloys."
TacticalText="<Bullet/>Grants silent takedown ability\n<Bullet/>Soldiers equipped with the combat knife gain + 1 mobility and have 20% less detection radius.<Bullet/>Pierces 1 armor."
AbilityDescName="SpecOps Combat Knife"

[SpecOpsKnife_MG X2WeaponTemplate]
FriendlyName="SpecOps Alloy Combat Knife"
FriendlyNamePlural="SpecOps Alloy Combat Knives"
BriefSummary="New research results allow us to incorporate alien alloys in our combat knife design."
TacticalText="<Bullet/>Grants silent takedown ability\n<Bullet/>Soldiers equipped with the combat knife gain + 1 mobility and have 20% less detection radius.\n<Bullet/>Pierces 2 armor."
AbilityDescName="SpecOps Alloy Combat Knife"

[SpecOpsKnife_BM X2WeaponTemplate]
FriendlyName="SpecOps Plasma Combat Knife"
FriendlyNamePlural="SpecOps Plasma Combat Knives"
BriefSummary="The plasma edged combat knife is our bleeding edge technology in the personal defense department."
TacticalText="<Bullet/>Grants silent takedown ability\n<Bullet/>Soldiers equipped with the combat knife gain + 1 mobility and have 20% less detection radius.\n<Bullet/>Pierces 3 armor."
AbilityDescName="SpecOps Plasma Combat Knife"

[MusashiThrowKnife X2AbilityTemplate]
LocFriendlyName="Throw Knife"
LocLongDescription="Throw a knife as a standard action. You have a chance to stay concealed."
LocHelpText="<Bullet/>Throw a knife as a standard action. You have a chance to stay concealed.<Bullet\>Killing the target divide the chance of revealment in half, if no other enemies sees the kill the chance is negated."
LocFlyOverText="Throw Knife" 
LocPromotionPopupText="Throw a knife as a standard action. You have a chance to stay concealed."

[MusashiThrowKnifeSecondary X2AbilityTemplate]
LocFriendlyName="Throw Knife"
LocLongDescription="Throw a knife as a standard action. You have a chance to stay concealed."
LocHelpText="<Bullet/>Throw a knife as a standard action. You have a chance to stay concealed.<Bullet\>Killing the target divide the chance of revealment in half, if no other enemies sees the kill the chance is negated."
LocFlyOverText="Throw Knife" 
LocPromotionPopupText="Throw a knife as a standard action. You have a chance to stay concealed."

[BackStabber X2AbilityTemplate]
LocFriendlyName="Backstabber"
LocLongDescription="Reduces the cooldown for SilentTakedown by 1 and adds 2 Bonus Damage for Combat Knives."
LocHelpText="Reduces the cooldown for SilentTakedown by 1 and adds + 2 Bonus Damage for Combat Knives."
LocFlyOverText="Knife Specialist"
LocPromotionPopupText="Reduces the cooldown for SilentTakedown by 1 and adds + 2 Bonus Damage for Combat Knives.<br/>"

[MusashiKnifeSpecialistBonus X2AbilityTemplate]
LocFriendlyName="Backstabber"
LocLongDescription="Reduces the cooldown for SilentTakedown by 1 and adds 2 Bonus Damage for Combat Knives."
LocHelpText="Reduces the cooldown for SilentTakedown by 1 and adds + 2 Bonus Damage for Combat Knives."
LocFlyOverText="Knife Specialist"
LocPromotionPopupText="<Bullet/>Reduces the cooldown for SilentTakedown by 1 and adds + 2 Bonus Damage for Combat Knives.<br/>"

[KnifeJuggler X2AbilityTemplate]
LocFriendlyName="Knife Juggler"
LocLongDescription="+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives."
LocHelpText="+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives."
LocFlyOverText="Knife Juggler"
LocPromotionPopupText="<Bullet/>+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives.<br/>"

[MusashiThrowingKnifeSpecialistBonus X2AbilityTemplate]
LocFriendlyName="Knife Juggler"
LocLongDescription="+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives."
LocHelpText="+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives."
LocFlyOverText="Knife Juggler"
LocPromotionPopupText="<Bullet/>+ 1 Bonus Damage for the throwing knives and +10 aim when using throwing knives. Also provides one additional charge for the utility throwing knives.<br/>"

[ThrowingKnifeFaceoff X2AbilityTemplate]
LocFriendlyName="House of 1000 Daggers"
LocLongDescription="Throw a knife at every visible enemy."
LocHelpText="Throw a knife at every visible enemy."
LocPromotionPopupText="<Bullet/> House of 1000 Daggers is best augmented by aggressive field position, granting a high chance to hit at multiple targets.<br/><Bullet/> House of 1000 Daggers has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[ReturnThrow X2AbilityTemplate]
LocFriendlyName="Return Throw"
LocHelpText="When targeted by enemy fire, automatically throw a knife back once per turn."
LocLongDescription="When targeted by enemy fire, automatically throw a knife back once per turn."
LocPromotionPopupText="<Bullet/> Return Throw will only trigger once per turn.<br/><Bullet/> Return Throw can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire Throw not trigger when targeted by Overwatch fire.<br/>"

[Hailstorm X2AbilityTemplate]
LocFriendlyName="Hail Storm"
LocLongDescription="Throw three knives at the same target."
LocHelpText="Throw three knives at the same target."
LocFlyOverText="Hail Storm"
LocPromotionPopupText="<Bullet/> Each throw in Hail Storm rolls a separate chance to hit.<br/><Bullet/> Hail Storm can deal a devastating amount of damage if every shot hits.<br/><Bullet/> Hail Storm has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[ThrowingKnifeQuickdraw X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Throwing a knive with your first action no longer ends your turn."
LocHelpText="Throwing a knive with your first action no longer ends your turn."
LocFlyOverText="Quickdraw"
LocPromotionPopupText="<Bullet/> Quickdraw is a fundamental Knife Juggler ability, as it allows the soldier to spread their knives around to different targets in the same turn.<br/>"
